public class Main {
    public static void main(String[] args) {

        int amount = 3500;
        int bonusMiles = amount / 20;

        System.out.println("Бонусные мили: " + bonusMiles);

        //int miles = amount/bonus
        // Объявляете переменные для входных данных и
        // параметров программы: одну для хранения
        // стоимости билета, другую для хранения количества
        // рублей для одной бонусной милли

        // Рассчитываете количество бонусных милль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран
    }
}